<?php

    $rus[] = "а";
    $rus[] = "ы";
    $rus[] = "ый";
    $rus[] = "ое";
    $rus[] = "ая";
    $rus[] = "ий";
    $rus[] = "у";
    $rus[] = "его";
    $rus[] = "ему";
    $rus[] = "ете";
    $rus[] = "ут";
    $rus[] = "ие";
    $rus[] = "е";
    $rus[] = "я";
    $rus[] = "ей";
    $rus[] = "ёй";
    $rus[] = "ю";
    $rus[] = "ые";
    $rus[] = "ите";
    $rus[] = "те";
    $rus[] = "ой";
    $rus[] = "ом";
    $rus[] = "ым";
    $rus[] = "ёк";
    $rus[] = "ия";
    $rus[] = "ы";

    $eng[] = "tion";
    $eng[] = "er";
    $eng[] = "e";
    $eng[] = "ing";
    $eng[] = "y";